In [6]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [7]:
# Import data and turn project path into a string
path = r'/Users/jerrysiphavong/Desktop/12-2024 Instacart Basket Analysis'

In [8]:
# Import customer data
customer = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [9]:
# Check if data has imported correctly
customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [10]:
customer.shape

(206209, 10)

In [11]:
# Check descriptions
customer.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [12]:
# Check data types
customer.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

# Wrangle the data so that it follows consistent logic

In [14]:
# Rename columns 
customer.rename(columns = {'Surnam' : 'Last Name'}, inplace = True)
customer.rename(columns = {'STATE' : 'State'}, inplace = True)
customer.rename(columns = {'fam_status' : 'Family Status'}, inplace = True)
customer.rename(columns = {'date_joined' : 'Date Joined'}, inplace = True)
customer.rename(columns = {'n_dependants' : 'Number of Dependents'}, inplace = True)
customer.rename(columns = {'income' : 'Income'}, inplace = True)
customer.rename(columns = {'user_id' : 'user_id'}, inplace = True)

In [15]:
# Check
customer.columns

Index(['user_id', 'First Name', 'Last Name', 'Gender', 'State', 'Age',
       'Date Joined', 'Number of Dependents', 'Family Status', 'Income'],
      dtype='object')

In [16]:
customer.head(5)

,user_id,First Name,Last Name,Gender,State,Age,Date Joined,Number of Dependents,Family Status,Income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [17]:
customer.describe()

             user_id            Age  Number of Dependents         Income
count  206209.000000  206209.000000         206209.000000  206209.000000
mean   103105.000000      49.501646              1.499823   94632.852548
std     59527.555167      18.480962              1.118433   42473.786988
min         1.000000      18.000000              0.000000   25903.000000
25%     51553.000000      33.000000              0.000000   59874.000000
50%    103105.000000      49.000000              1.000000   93547.000000
75%    154657.000000      66.000000              3.000000  124244.000000
max    206209.000000      81.000000              3.000000  593901.000000

In [18]:
# Missing values
missing = customer.isnull().sum()

In [19]:
missing

user_id                     0
First Name              11259
Last Name                   0
Gender                      0
State                       0
Age                         0
Date Joined                 0
Number of Dependents        0
Family Status               0
Income                      0
dtype: int64

In [20]:
# Duplicates
duplicates = customer.duplicated()

In [21]:
dupe = duplicates.sum()

In [22]:
dupe

0

In [23]:
# There are no missing values or duplicates in the data frame. 
# Renamed all column titles to be uniform and readable
# Data frame is now ready for combining

# Combine customer data with the rest of prepared Instacard data

In [25]:
# Importing dataframe
ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_update_1.pkl'))

In [26]:
# Check
ords_prods.shape

(32434212, 25)

In [27]:
ords_prods.head(5)

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,eval_set,order_number,orders_day_of_week,...,price_range_loc,busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_spend,average_spending,spending_flag,order_frequency,order_frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,prior,28,6,...,Mid-range product,Regularly busy,Most orders,32,Regular customer,6.935811,6.935811,Low spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,prior,30,6,...,Mid-range product,Regularly busy,Average orders,32,Regular customer,6.935811,6.935811,Low spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,prior,2,0,...,Mid-range product,Busiest days,Average orders,5,New customer,7.930208,7.930208,Low spender,8.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,prior,1,3,...,Mid-range product,Slowest days,Most orders,3,New customer,4.972414,4.972414,Low spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,prior,3,4,...,Mid-range product,Slowest days,Average orders,3,New customer,4.972414,4.972414,Low spender,9.0,Frequent customer

In [28]:
# Check data type for ords_prods
ords_prods.dtypes

product_id                   int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
order_id                     int64
user_id                      int64
eval_set                    object
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
add_to_cart_order            int64
reordered                    int64
_merge                    category
price_range_loc             object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
average_spend              float64
average_spending           float64
spending_flag               object
order_frequency            float64
order_frequency_flag        object
dtype: object

In [29]:
# user_id data types must match
ords_prods.dtypes['user_id']

dtype('int64')

In [30]:
customer.dtypes['user_id']

dtype('int64')

In [31]:
# Change ords_prods 'user_id' to string
ords_prods['user_id'] = ords_prods['user_id'].astype('str')

In [32]:
# Change customer 'user_id' to string
customer['user_id'] = customer['user_id'].astype('str')

In [54]:
# Drop the existing '_merge' column
ords_prods = ords_prods.drop(columns=['_merge'])

In [60]:
# Combine
df_merge = pd.merge(ords_prods, customer, on='user_id', how='inner')

In [62]:
# Check if merge was successful
df_merge.shape

(32434212, 34)

In [68]:
# customer (206209, 10) / ords_prods (32434212, 25) 
# you can see the above column has increased

In [70]:
df_merge.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,eval_set,order_number,orders_day_of_week,...,order_frequency_flag,First Name,Last Name,Gender,State,Age,Date Joined,Number of Dependents,Family Status,Income
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,prior,28,6,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,prior,30,6,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,prior,2,0,...,Frequent customer,Deborah,Glass,Female,Vermont,66,6/16/2018,2,married,158302
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,prior,1,3,...,Frequent customer,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,prior,3,4,...,Frequent customer,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308

In [74]:
# Export
df_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'customer_ords_merge.pkl'))